qoAopx/relay_LoRa/esp32_e220900t22s_jp_lib_v2.cpp
/**
  Author Company:
    CLEALINK TECHNOLOGY Co.,Ltd.

  Description:
        Device            :  ESP32
        Library Version   :  2.0
*/

#include  "esp32_e220900t22s_jp_lib_v2.h"

//--- USE Serial Monitor or not / for Debugging
#define USE_SERIAL_PRINT 1

//MACROS
#if  USE_SERIAL_PRINT
#define Print Serial.printf
#define PrintLn Serial.println
#else
#define Print \
  // No Operation
#define PrintLn \
  // No Operation
#endif

// ------------------------------


SemaphoreHandle_t xMutex;

template<typename T>
bool ConfRange(T target, T min, T max);

int CLoRa::LoadConfigSetting(const char *filename, struct LoRaConfigItem_t &config) {
  int ret = 0;

  if (!SPIFFS.begin(true)) {
    Print("SPIFFS Mount Failed.\n");
  }

  // 最初にデフォルト値をセット
  SetDefaultConfigValue(config);

  // ESP32内にコンフィグファイルがあるか否か
  if (!SPIFFS.exists(filename)) {
    Print("config file is NOT exists.\n");
    ret = 1;
  } else {
    Print("\n Read config file %s.\n", filename);


    // コンフィグ値を設定
    // 値範囲外や読取エラー時はデフォルト値使用
    ret = OpenConfigFile(filename, config);
  }

  return ret;
}

int CLoRa::CheckFirmwareVersion() {
  uint8_t RetNo;

  RetNo = ReadFirmwareVersion();
  if (FIRMWARE_VERSION != RetNo ) return 1;

  return 0;
}


int CLoRa::InitLoRaModule(struct LoRaConfigItem_t &config) {
  int ret = 0;
  uint8_t checksum = 0;
  uint8_t ch;

  xMutex = xSemaphoreCreateMutex();
  xSemaphoreGive(xMutex);

  // コンフィグモード(M0=1,M1=1)へ移行する
  Print("switch to configuration mode\n");
  SwitchToConfigurationMode();

  pinMode(LoRa_AUXPin, INPUT);
  const unsigned long started = millis();
  while (digitalRead(LoRa_AUXPin) == LOW) {
    if (millis() - started > 1000) {
      return 2;  // AUX timeout
    }
    delay(1);
  }
  delay(50);

  SerialLoRa.begin(LoRa_BaudRate, SERIAL_8N1, LoRa_RxPin, LoRa_TxPin);

  // Configuration
  std::vector<uint8_t> command = { 0xc0, 0x00, 0x08 };
  std::vector<uint8_t> response = {};

  // Register Address 00H, 01H
  uint8_t ADDH = config.own_address >> 8;
  uint8_t ADDL = config.own_address & 0xff;
  command.push_back(ADDH);
  command.push_back(ADDL);

  // Register Address 02H
  uint8_t REG0 = 0;
  REG0 = REG0 | (config.baud_rate << 5);
  REG0 = REG0 | (config.air_data_rate);
  command.push_back(REG0);

  // Register Address 03H
  uint8_t REG1 = 0;
  REG1 = REG1 | (config.subpacket_size << 6);
  REG1 = REG1 | (config.rssi_ambient_noise_flag << 5);
  REG1 = REG1 | (config.transmitting_power);
  command.push_back(REG1);

  // Register Address 04H
  uint8_t REG2 = config.own_channel;
  command.push_back(REG2);

  // Register Address 05H
  uint8_t REG3 = 0;
  REG3 = REG3 | (config.rssi_byte_flag << 7);
  REG3 = REG3 | (config.transmission_method_type << 6);
#if FIRMWARE_VERSION == 0x28
  REG3 = REG3 | (config.transmitting_power_table << 5);
#endif
  REG3 = REG3 | (config.wor_cycle);
  command.push_back(REG3);

  // Register Address 06H, 07H
  uint8_t CRYPT_H = config.encryption_key >> 8;
  uint8_t CRYPT_L = config.encryption_key & 0xff;
  command.push_back(CRYPT_H);
  command.push_back(CRYPT_L);



  Print("# Command Request\n");
  for (auto i : command) {
    ch = i;
    Print("0x%02x ", i);
    checksum ^= ch;
  }
  Print("\n");
#if ( (FIRMWARE_VERSION == 0x20) || (FIRMWARE_VERSION == 0x28) )
  if (IsNow_SendPKT_CS_EN) command.push_back(checksum);
#endif
  if (xSemaphoreTake(xMutex, (portTickType)100) == pdTRUE) {
    for (auto i : command) {
      SerialLoRa.write(i);
    }

    SerialLoRa.flush();
    xSemaphoreGive(xMutex);
  }

  // delay(100);  // ★旧：AUXを見ない固定待ちのため応答タイミングがシビアだと取りこぼす

  // ★修正：AUXがHIGH（モジュールの処理完了）に戻るまで待つ。
  //   タイムアウトを設けて、万一AUXが機能しない配線でもフリーズしないようにする。
  unsigned long auxWaitStart = millis();
  while (digitalRead(LoRa_AUXPin) == LOW) {
    if (millis() - auxWaitStart > 1000) {
      Print("AUX wait timeout in InitLoRaModule()\n");
      break;
    }
    delay(2);
  }
  delay(20);  // AUXがHIGHに戻った直後の追加安定待ち（データシート推奨）

  while (SerialLoRa.available()) {
    if (xSemaphoreTake(xMutex, (portTickType)100) == pdTRUE) {
      uint8_t data = SerialLoRa.read();
      response.push_back(data);
      xSemaphoreGive(xMutex);
    }
  }
  Print("# Command Response\n");

  for (auto i : response) {
    Print("0x%02x ", i);
  }
  Print("\n");

  if (response.size() != command.size()) {
    ret = 1;
  }

  return ret;
}

#if FIRMWARE_VERSION < 0x20

// --- the beginning of ReceiveFlame // ver.1.x

int CLoRa::ReceiveFrame(struct RecvFrameE220900T22SJP_t *recv_frame) {
  int len = 0;
  uint8_t *start_p = recv_frame->recv_data;

  memset(recv_frame->recv_data, 0x00, sizeof(recv_frame->recv_data) / sizeof(recv_frame->recv_data[0]));

  while (1) {

    while (SerialLoRa.available()) {
      if (xSemaphoreTake(xMutex, (portTickType)100) == pdTRUE) {
        uint8_t ch = SerialLoRa.read();
        Print("%02x ", ch);

        *(start_p + len) = ch;

        len++;
        xSemaphoreGive(xMutex);
      }

      if (len > 408) {
        return 1;
      }
    }

    if ((SerialLoRa.available() == 0) && (len > 0)) {
      delay(10);
      if (SerialLoRa.available() == 0) {
        recv_frame->recv_data_len = len;
        if ( config.rssi_byte_flag ){
          recv_frame->recv_data_len -= 1;
          recv_frame->rssi = recv_frame->recv_data[len - 1] - 256;
        }
        break;
      }
    }
    delay(100);
  }
  Print("\nReceived Length = %d", recv_frame->recv_data_len );

  return 0;
}

#endif

// --- the end of ReceiveFlame // ver.1.x



int CLoRa::SendFrame(struct LoRaConfigItem_t &config, uint8_t *send_data, int size) {
  uint8_t subpacket_size = 0;

  //while (!LoRa_AUXPin);
  // ★修正：AUXがHIGH（モジュールの処理完了）に戻るまで待つ。
  //   タイムアウトを設けて、万一AUXが機能しない配線でもフリーズしないようにする。
  unsigned long auxWaitStart = millis();
  while (digitalRead(LoRa_AUXPin) == LOW) {
    if (millis() - auxWaitStart > 1000) {
      Print("AUX wait timeout in InitLoRaModule()\n");
      break;
    }
    delay(2);
  }
  delay(20);  // AUXがHIGHに戻った直後の追加安定待ち（データシート推奨）
  //  Print("\n.......... send data length = %d \n", size);

  switch (config.subpacket_size) {
    case 0b00:
      subpacket_size = 200;
      break;
    case 0b01:
      subpacket_size = 128;
      break;
    case 0b10:
      subpacket_size = 64;
      break;
    case 0b11:
      subpacket_size = 32;
      break;
    default:
      subpacket_size = 200;
      break;
  }
  if (size > subpacket_size) {
    Print("send data length too long\n");
    return 1;
  }
  uint8_t target_address_H = config.target_address >> 8;
  uint8_t target_address_L = config.target_address & 0xff;
  uint8_t target_channel = config.target_channel;

  if (config.transmission_method_type == 0) size -= 3;  // -3 is to declare num of bytes of frame

  uint8_t frame[3 + size] = { target_address_H, target_address_L, target_channel };

  if (config.transmission_method_type == 1) {
    memmove(frame + 3, send_data, size);
  } else {
    memmove(frame, send_data, size + 3);                // +3 is to collect num of bytes
  }


#if 0 /* print debug */
  for (int i = 0; i < 3 + size; i++) {
    if (i < 3) {
      Print("%02x", frame[i]);
    } else {
      Print("%c", frame[i]);
    }
  }
  Print("\n");
#endif

  char checksum = 0;
  if (xSemaphoreTake(xMutex, (portTickType)100) == pdTRUE) {
    for (auto i : frame) {
      SerialLoRa.write(i);
      checksum ^= i;
    }
#if ( (FIRMWARE_VERSION == 0x20) || (FIRMWARE_VERSION == 0x28))
    if ( IsNow_SendPKT_CS_EN )  SerialLoRa.write(checksum);
#endif
    SerialLoRa.flush();
    delay(100);
    while (SerialLoRa.available()) {
      while (SerialLoRa.available()) {
        SerialLoRa.read();
      }
      delay(100);
    }
    xSemaphoreGive(xMutex);
  }
#if ( (FIRMWARE_VERSION == 0x20) || (FIRMWARE_VERSION == 0x28))
  if ( IsNow_SendPKT_CS_EN )  Print("\n...Send Checksum = %02x", checksum);
#endif
  return 0;
}

