qoAopx/relay_LoRa/esp32_e220900t22s_jp_lib_v2.cpp
void CLoRa::SwitchToNormalMode(void) {
  pinMode(LoRa_ModeSettingPin_M0, OUTPUT);
  pinMode(LoRa_ModeSettingPin_M1, OUTPUT);

  digitalWrite(LoRa_ModeSettingPin_M0, 0);
  digitalWrite(LoRa_ModeSettingPin_M1, 0);
  delay(100);
}

void CLoRa::SwitchToWORSendingMode(void) {
  pinMode(LoRa_ModeSettingPin_M0, OUTPUT);
  pinMode(LoRa_ModeSettingPin_M1, OUTPUT);

  digitalWrite(LoRa_ModeSettingPin_M0, 1);
  digitalWrite(LoRa_ModeSettingPin_M1, 0);
  delay(100);
}

void CLoRa::SwitchToWORReceivingMode(void) {
  pinMode(LoRa_ModeSettingPin_M0, OUTPUT);
  pinMode(LoRa_ModeSettingPin_M1, OUTPUT);

  digitalWrite(LoRa_ModeSettingPin_M0, 0);
  digitalWrite(LoRa_ModeSettingPin_M1, 1);
  delay(100);
}

void CLoRa::SwitchToConfigurationMode(void) {
  pinMode(LoRa_ModeSettingPin_M0, OUTPUT);
  pinMode(LoRa_ModeSettingPin_M1, OUTPUT);

  digitalWrite(LoRa_ModeSettingPin_M0, 1);
  digitalWrite(LoRa_ModeSettingPin_M1, 1);
  delay(100);
}

// priority definition A (1 - 13)

void CLoRa::SetDefaultConfigValue_into_private_val(){
    own_address_val = 0x0000;         // 1
    baud_rate_val = 9600;             // 2
    bw_val = 125;                     // 3
    sf_val = 9;                       // +3
    subpacket_size_val = 200;         // 4
    rssi_ambient_noise_flag_val = 1;  // 5
    transmitting_power_val = 13;      // 6
    own_channel_val = 0x0;            // 7
    rssi_byte_flag_val = 1;           // 8
    transmission_method_type_val = 1; // 9
    wor_cycle_val = 2000;             //10
    encryption_key_val = 0;           //11

    target_address_val = 0x0000;      //12
    target_channel_val = 0x0;         //13
}

void CLoRa::SetDefaultConfigValue(struct LoRaConfigItem_t &config) {

// E220-900T22S/L Default definition B (1 - 13)

  const LoRaConfigItem_t default_config = {
    0x0000,   // 1 own_address 0
    0b011,    // 2 baud_rate 9600 bps
    0b10000,  // 3 air_data_rate SF:9 BW:125
    0b00,     // 4 subpacket_size 200
    0b0,      // 5 rssi_ambient_noise_flag 無効
    0b01,     // 6 transmitting_power 13 dBm
    0x0,      // 7 own_channel 0
    0b0,      // 8 rssi_byte_flag 無効
    0b1,      // 9 transmission_method_type 固定送信モード
    0b011,    //10 wor_cycle 2000 ms
    0x0000,   //11 encryption_key 0

    0x0000,   //12 target_address 0
    0x00,     //13 target_channel 0

#if ( (FIRMWARE_VERSION == 0x20) || (FIRMWARE_VERSION == 0x28) )
    0b1,      // strict_mode
    0b0,      // Lowvoltage_operation enable = 0
    0b0,      // recv_target_address disable
    0b0,      // send_data_checksum disable
    0b0,      // recv_data_checksum disable
    0b1,      // recv_data_packetsize enable
    0b00,     // aux_low_holdtime 00 default:2-3msec
    0x00,     // carriresense_timeout 00 (default)
#endif
#if FIRMWARE_VERSION == 0x28
    0b0      // transmitting_power_table table A
#endif
  };

  config = default_config;

  // 設定値をセットする   default definition A ( 1 - 13 )を　優先
  SetDefaultConfigValue_into_private_val();
  SetConfigValue(config);
}

int CLoRa::OpenConfigFile(const char *filename, struct LoRaConfigItem_t &config) {
  int ret = 0;

  // フラッシュメモリのファイルを開く
  File file = SPIFFS.open(filename, FILE_READ);
  if (!file) {
    Print("file open failed.\n");
    return 1;
  }

  while (file.available()) {
    int i;
    String key = file.readStringUntil('=');

    // Skip CR,LF and <'A'
      for ( i = 0; i < sizeof(key) ; i++) if( key[i] >= 'A') break;
      if ( i != 0 ) key.remove(0, i);

    String val = file.readStringUntil('\n');

        Print("\n%s", key.c_str());
        Print(" = %s", val.c_str());

    key.toLowerCase();
    val.toLowerCase();

    // 設定値を内部変数に読み取る
    ReadConfigValue(key.c_str(), val.c_str());

  }
  PrintLn('\n');

  // 設定値をセットする
  SetConfigValue(config);

  return ret;
}




#if ( (FIRMWARE_VERSION == 0x20) || (FIRMWARE_VERSION == 0x28) )

//MACROS
#if  USE_SERIAL_PRINT
#define Putb_p putb
#else
#define Putb_p \
  // No Operation
#endif


#define CHAR_BIT 8

//extern uint8_t RSSINoise[10];
void printb(uint8_t dat) {
  unsigned int mask = (int)1 << (sizeof(dat) * CHAR_BIT - 1);
  do Serial.write(mask & dat ? '1' : '0');
  while (mask >>= 1);
}

void putb(uint8_t dat) {
  Serial.write('0'), Serial.write('b'), printb(dat);
}


// Keywords for ver.2.x

const char ENABLE[] = "enable";
const char DISABLE[] = "disable";
const char WrongSpell[] = "\nWrong Spell not \"enable\" or \"disable\" at \"";

const char STRICT_MODE[] = "strict_mode";
const char LOWVOLTAGE_OP[] = "lowvoltage_operation";
const char RECV_ADD[] = "recv_target_address";
const char SEND_CHKSUM[] = "send_data_checksum";
const char RECV_CHKSUM[] = "recv_data_checksum";
const char RECV_DATA_SIZE[] = "recv_data_packetsize";
const char AUX_HOLD[] = "aux_low_holdtime";
const char CARRIRESENSE[] = "carriresense_timeout";
#endif


int CLoRa::ReadConfigValue(const char *key, const char *val) {
  int number = 0;
  int err = 0;

  if (strcmp(key, "own_address") == 0) {
    number = atoi(val);
    own_address_val = number;
  } else if (strcmp(key, "baud_rate") == 0) {
    number = atoi(val);
    baud_rate_val = number;
  } else if (strcmp(key, "bw") == 0) {
    number = atoi(val);
    bw_val = number;
  } else if (strcmp(key, "sf") == 0) {
    number = atoi(val);
    sf_val = number;
  } else if (strcmp(key, "subpacket_size") == 0) {
    number = atoi(val);
    subpacket_size_val = number;
  } else if (strcmp(key, "transmitting_power") == 0) {
    number = atoi(val);
    transmitting_power_val = number;
  } else if (strcmp(key, "own_channel") == 0) {
    number = atoi(val);
    own_channel_val = number;
  } else if (strcmp(key, "wor_cycle") == 0) {
    number = atoi(val);
    wor_cycle_val = number;
  } else if (strcmp(key, "encryption") == 0) {
    number = atoi(val);
    encryption_key_val = number;
  } else if (strcmp(key, "target_address") == 0) {
    number = atoi(val);
    target_address_val = number;
  } else if (strcmp(key, "target_channel") == 0) {
    number = atoi(val);
    target_channel_val = number;
  } else if (strcmp(key, "transmission_method_type") == 0) {
    number = atoi(val);
    transmission_method_type_val = number;
  } else if (strcmp(key, "rssi_byte_flag") == 0) {
    number = atoi(val);
    rssi_byte_flag_val = number;
  } else if (strcmp(key, "rssi_ambient_noise_flag") == 0) {
    number = atoi(val);
    rssi_ambient_noise_flag_val = number;
  }

#if ( (FIRMWARE_VERSION == 0x20) || (FIRMWARE_VERSION == 0x28) )
  else if (strcmp(key, STRICT_MODE) == 0) {
    if (strcmp(val, ENABLE) == 0) {
      config.strict_mode = 0b1;
    } else if (strcmp(val, DISABLE) == 0) {
      config.strict_mode = 0b0;
    } else {
      Print(WrongSpell);
      Print("%s\"\n", key);
    }
  } else if (strcmp(key, LOWVOLTAGE_OP) == 0) {
    if (strcmp(val, ENABLE) == 0) {
      config.Lowvoltage_operation = 0b0;
    } else if (strcmp(val, DISABLE) == 0) {
      config.Lowvoltage_operation = 0b1;
    } else {
      Print(WrongSpell);
      Print("%s\"\n", key);
    }
  } else if (strcmp(key, RECV_ADD) == 0) {
    if (strcmp(val, ENABLE) == 0) {
      config.recv_target_address = 0b1;
    } else if (strcmp(val, DISABLE) == 0) {
      config.recv_target_address = 0b0;
    } else {
      Print(WrongSpell);
      Print("%s\"\n", key);
    }
  } else if (strcmp(key, SEND_CHKSUM) == 0) {
    if (strcmp(val, ENABLE) == 0) {
      config.send_data_checksum = 0b1;
    } else if (strcmp(val, DISABLE) == 0) {
      config.send_data_checksum = 0b0;
    } else {
      Print(WrongSpell);
      Print("%s\"\n", key);
    }
  } else if (strcmp(key, RECV_CHKSUM) == 0) {
    if (strcmp(val, ENABLE) == 0) {
      config.recv_data_checksum = 0b1;
    } else if (strcmp(val, DISABLE) == 0) {
      config.recv_data_checksum = 0b0;
    } else {
      Print(WrongSpell);
      Print("%s\"\n", key);
    }
  } else if (strcmp(key, RECV_DATA_SIZE) == 0) {
    if (strcmp(val, ENABLE) == 0) {
      config.recv_data_packetsize = 0b1;
    } else if (strcmp(val, DISABLE) == 0) {
      config.recv_data_packetsize = 0b0;
    } else {
      Print(WrongSpell);
      Print("%s\"\n", key);
    }
  } else if (strcmp(key, AUX_HOLD) == 0) {
    number = atoi(val);
    switch (number) {
      case 2:
      case 3:
        config.aux_low_holdtime = 0b00;
        break;
      case 512:
        config.aux_low_holdtime = 0b01;
        break;
      case 1024:
        config.aux_low_holdtime = 0b10;
        break;
      case 0:
        config.aux_low_holdtime = 0b11;
        break;
      default:
        config.aux_low_holdtime = 0b00;       // default 2 or 3
        Print("%s invalid value.\n", AUX_HOLD);
        Print("default %s value is used.\n", AUX_HOLD);
        break;
    }
  } else if (strcmp(key, CARRIRESENSE) == 0) {
    number = atoi(val);
    if ( number >= 256 ) {
      Print("%s invalid value.\n", CARRIRESENSE);
      Print("default %s value is used.\n", CARRIRESENSE);
      config.carriresense_timeout = 0;
    } else {
      config.carriresense_timeout = number;
    }
  }
#endif


