qoAopx/relay_LoRa/esp32_e220900t22s_jp_lib_v2.cpp
  return err;
}

// コンフィグ値が設定範囲内か否か
template<typename T>
bool ConfRange(T target, T min, T max) {
  if (target >= min && target <= max) {
    return true;
  } else {
    return false;
  }
}

int CLoRa::SetConfigValue(struct LoRaConfigItem_t &config) {
  int err = 0;

  // own_address
  if (ConfRange((int)own_address_val, 0, 65535)) {
    config.own_address = own_address_val;
  } else {
    err = 1;
    Print("own_address invalid value.\n");
    Print("default own_address value is used.\n");
  }

  // baud_rate
  switch (baud_rate_val) {
    case 1200:
      config.baud_rate = 0b000;
      break;
    case 2400:
      config.baud_rate = 0b001;
      break;
    case 4800:
      config.baud_rate = 0b010;
      break;
    case 9600:
      config.baud_rate = 0b011;
      break;
    case 19200:
      config.baud_rate = 0b100;
      break;
    case 38400:
      config.baud_rate = 0b101;
      break;
    case 57600:
      config.baud_rate = 0b110;
      break;
    case 115200:
      config.baud_rate = 0b111;
      break;
    default:
      err = 1;
      Print("baud_rate invalid value.\n");
      Print("default baud_rate value is used.\n");
      break;
  }

  // air_data_rate
  switch (bw_val) {
    case 125:
      switch (sf_val) {
        case 5:
          config.air_data_rate = 0b00000;
          break;
        case 6:
          config.air_data_rate = 0b00100;
          break;
        case 7:
          config.air_data_rate = 0b01000;
          break;
        case 8:
          config.air_data_rate = 0b01100;
          break;
        case 9:
          config.air_data_rate = 0b10000;
          break;
        default:
          err = 1;
          Print("sf invalid value.\n");
          Print("default sf value is used.\n");
          break;
      }
      break;
    case 250:
      switch (sf_val) {
        case 5:
          config.air_data_rate = 0b00001;
          break;
        case 6:
          config.air_data_rate = 0b00101;
          break;
        case 7:
          config.air_data_rate = 0b01001;
          break;
        case 8:
          config.air_data_rate = 0b01101;
          break;
        case 9:
          config.air_data_rate = 0b10001;
          break;
        case 10:
          config.air_data_rate = 0b10101;
          break;
        default:
          err = 1;
          Print("sf invalid value.\n");
          Print("default sf value is used.\n");
          break;
      }
      break;
    case 500:
      switch (sf_val) {
        case 5:
          config.air_data_rate = 0b00010;
          break;
        case 6:
          config.air_data_rate = 0b00110;
          break;
        case 7:
          config.air_data_rate = 0b01010;
          break;
        case 8:
          config.air_data_rate = 0b01110;
          break;
        case 9:
          config.air_data_rate = 0b10010;
          break;
        case 10:
          config.air_data_rate = 0b10110;
          break;
        case 11:
          config.air_data_rate = 0b11010;
          break;
        default:
          err = 1;
          Print("sf invalid value.\n");
          Print("default sf value is used.\n");
          break;
      }
      break;
    default:
      err = 1;
      Print("bw invalid value.\n");
      Print("default bw and sf value is used.\n");
      break;
  }

  // subpacket_size
  switch (subpacket_size_val) {
    case 200:
      config.subpacket_size = 0b00;
      break;
    case 128:
      config.subpacket_size = 0b01;
      break;
    case 64:
      config.subpacket_size = 0b10;
      break;
    case 32:
      config.subpacket_size = 0b11;
      break;
    default:
      err = 1;
      Print("subpacket_size invalid value.\n");
      Print("default subpacket_size value is used.\n");
      break;
  }

  // transmitting_power
  switch (transmitting_power_val) {
    case 13:
      config.transmitting_power = 0b01;
      break;
    case 7:
      config.transmitting_power = 0b10;
      break;
    case 0:
      config.transmitting_power = 0b11;
      break;

    default:
#if FIRMWARE_VERSION == 0x20
      if ( (transmitting_power_val >= 1 ) && (transmitting_power_val <= 12 )) {
        config.transmitting_power = transmitting_power_val + 3;
        break;
      }
#endif

#if FIRMWARE_VERSION == 0x28
      if ( (transmitting_power_val >= 1 ) && (transmitting_power_val <= 22 )) {
        if ( transmitting_power_val & 0b00010000 )config.transmitting_power_table = 0b00;
        else                                      config.transmitting_power_table = 0b01;
        config.transmitting_power = (transmitting_power_val ^ 0b00001111) & 0b00001111;
        break;
      }
#endif
      err = 1;
      Print("transmitting_power invalid value.\n");
      Print("default transmitting_power value is used.\n");
      break;
  }

  // own_channel
  switch (bw_val) {
    case 125:
      if (ConfRange((int)own_channel_val, 0, 37)) {
        config.own_channel = own_channel_val;
      } else {
        err = 1;
        Print("own_channel invalid value.\n");
        Print("default own_channel value is used.\n");
      }
      break;
    case 250:
      if (ConfRange((int)own_channel_val, 0, 36)) {
        config.own_channel = own_channel_val;
      } else {
        err = 1;
        Print("own_channel invalid value.\n");
        Print("default own_channel value is used.\n");
      }
      break;
    case 500:
      if (ConfRange((int)own_channel_val, 0, 30)) {
        config.own_channel = own_channel_val;
      } else {
        err = 1;
        Print("own_channel invalid value.\n");
        Print("default own_channel value is used.\n");
      }
      break;
    default:
      err = 1;
      Print("bw invalid value.\n");
      Print("default own_channel value is used.\n");
      break;
  }

  // wor_cycle
  switch (wor_cycle_val) {
    case 500:
      config.wor_cycle = 0b000;
      break;
    case 1000:
      config.wor_cycle = 0b001;
      break;
    case 1500:
      config.wor_cycle = 0b010;
      break;
    case 2000:
      config.wor_cycle = 0b011;
      break;
    case 2500:
      config.wor_cycle = 0b100;
      break;
    case 3000:
      config.wor_cycle = 0b101;
      break;
    default:
      err = 1;
      Print("wor_cycle invalid value.\n");
      Print("default wor_cycle value is used.\n");
      break;
  }
  // encryption_key
  if (ConfRange((int)encryption_key_val, 0, 65535)) {
    config.encryption_key = encryption_key_val;
  } else {
    err = 1;
    Print("encryption_key invalid value.\n");
    Print("default encryption_key value is used.\n");
  }

