qoAopx/relay_LoRa/esp32_e220900t22s_jp_lib_v2.cpp
  // transmission_method_type
  switch (transmission_method_type_val) {
    case 0 :
    case 1 :
      config.transmission_method_type = transmission_method_type_val;

      break;
    default :
      err = 1;
      Print("transmission_method_type invalid value.\n");
      Print("default transmission_method_type value is used.\n");
  }

  // rssi_byte_flag
  switch (rssi_byte_flag_val) {
    case 0 :
    case 1 :
      config.rssi_byte_flag = rssi_byte_flag_val;

      break;
    default :
      err = 1;
      Print("rssi_byte_flag invalid value.\n");
      Print("default rssi_byte_flag value is used.\n");
  }
  // rssi_ambient_noise_flag
  switch (rssi_ambient_noise_flag_val) {
    case 0 :
    case 1 :
      config.rssi_ambient_noise_flag = rssi_ambient_noise_flag_val;

      break;
    default :
      err = 1;
      Print("rssi_ambient_noise_flag invalid value.\n");
      Print("default rssi_ambient_noise_flag value is used.\n");
  }

  // target_address
  if (ConfRange((int)target_address_val, 0, 65535)) {
    config.target_address = target_address_val;
  } else {
    err = 1;
    Print("target_address invalid value.\n");
    Print("default target_address value is used.\n");
  }

  // target_channel
  switch (bw_val) {
    case 125:
      if (ConfRange((int)target_channel_val, 0, 37)) {
        config.target_channel = target_channel_val;
      } else {
        err = 1;
        Print("target_channel invalid value.\n");
        Print("default target_channel value is used.\n");
      }
      break;
    case 250:
      if (ConfRange((int)target_channel_val, 0, 36)) {
        config.target_channel = target_channel_val;
      } else {
        err = 1;
        Print("target_channel_val invalid value.\n");
        Print("default target_channel_val value is used.\n");
      }
      break;
    case 500:
      if (ConfRange((int)target_channel_val, 0, 30)) {
        config.target_channel = target_channel_val;
      } else {
        err = 1;
        Print("target_channel_val invalid value.\n");
        Print("default target_channel_val value is used.\n");
      }
      break;
    default:
      err = 1;
      Print("bw invalid value.\n");
      Print("default target_channel_val value is used.\n");
      break;
  }

  return err;
}



#if ( (FIRMWARE_VERSION == 0x20) || (FIRMWARE_VERSION == 0x28) )



uint8_t CLoRa::ReadFirmwareVersion() {

  if ( Read_RegisterLIB(8, 1) ) return -1;
  return REGData.REGUniStr.val[0];
}

#else

const char ReadFirmWareVersionSTR[3] = {'\xc1', '\x08', '\x01'};  // ver.1.x compatible mode


uint8_t CLoRa::ReadFirmwareVersion() {
  uint8_t RetCode[5];

  SwitchToConfigurationMode();

  SerialLoRa.write(ReadFirmWareVersionSTR, 3);
  SerialLoRa.flush();
  delay(100);
  uint16_t len = 0;
  while (SerialLoRa.available()) {
    char ch = SerialLoRa.read();
    if (len > 5) continue;         // skip response (included if Received data in buffer exist)
    RetCode[len++] = ch;
  }
  Print("\n... \n");

  SwitchToNormalMode();

  return RetCode[3];
}
#endif




// -----------------------------------------------------------------------------------

#if ( (FIRMWARE_VERSION == 0x20) || (FIRMWARE_VERSION == 0x28) )


int CLoRa::init_REG09_0A_Byte() {
  //#if (FIRMWARE_VERSION < 0x20)
  //  return;
  //#endif

  int retcode = 0;

  REG09_Byte = SendPKT_CS_EN;        // for sending Initialize with CheckSUM
  REG0A_Byte = 0;                    // 0
  retcode = REG0A_ByteWrite();                 // Pseude Clear

  retcode |= REG09_ByteWrite(0b00000000);       // Pseude for sending Initialize with CheckSUM

  REG09_Byte = 0x00;
  retcode |= REG09_ByteWrite();                 // Genuine Clear 09H

  return retcode;
}

int CLoRa::SetConfigStrictMode() {
  int retcode = 0;
  // コンフィグモード(M0=1,M1=1)へ移行する
  SwitchToConfigurationMode();

  conf_REG09_Byte = config.Lowvoltage_operation << 7;
  conf_REG09_Byte |= config.strict_mode << 6;
  conf_REG09_Byte |= config.recv_target_address << 5;
  conf_REG09_Byte |= config.send_data_checksum << 4;
  conf_REG09_Byte |= config.recv_data_checksum << 3;
  conf_REG09_Byte |= config.recv_data_packetsize << 2;
  conf_REG09_Byte |= config.aux_low_holdtime;
  conf_REG0A_Byte = config.carriresense_timeout;

  Print("\nconf_REG09_Byte = %02x", conf_REG09_Byte);
  if ( !(conf_REG09_Byte & StrictMode_EN) ) return 1;

  retcode = REG09_ByteWrite(conf_REG09_Byte);
  REG09_Byte = conf_REG09_Byte;
  retcode |= REG0A_ByteWrite();

  // ノーマルモード(M0=0,M1=0)へ移行する
  SwitchToNormalMode();

  return retcode;
}






// --- the beginning of ReceiveFlame // ver.2.0

int  CLoRa::ReceiveFrame(struct RecvFrameE220900T22SJP_t *recv_frame) {
  int len = 0;
  uint8_t *start_p = recv_frame->recv_data;


  memset(recv_frame->recv_data, 0x00, sizeof(recv_frame->recv_data) / sizeof(recv_frame->recv_data[0]));

  uint8_t checksum = 0;
  uint8_t previous_checksum = 0;

  while (1) {
    while (SerialLoRa.available()) {
      if (xSemaphoreTake(xMutex, (portTickType)100) == pdTRUE) {
        uint8_t ch = SerialLoRa.read();
        if ( len < 32 ) Print("%02x ", ch);

        *(start_p + len) = ch;
        previous_checksum = checksum;
        checksum ^= ch;

        len++;
        xSemaphoreGive(xMutex);
      }
      if (len > 408) {
        return 1;
      }
    }

    if ((SerialLoRa.available() == 0) && (len > 0)) {
      delay(10);
      if (SerialLoRa.available() == 0) {
        recv_frame->recv_data_len = len;
        if ( config.rssi_byte_flag ) {
          recv_frame->recv_data_len -= 1;
          recv_frame->rssi = recv_frame->recv_data[len - 1] - 256;
        }
        break;
      }
    }
    delay(100);
  }

#if RECEIVE_DATA_CHECK == 0

  RcvPacket[0].packet_address = 0xffff;
  RcvPacket[0].recv_multi_pkt_f = 0;
  RcvPacket[0].packet_error = 0;
  RcvPacket[0].packet_rssi = recv_frame->rssi ;
  if ( config.rssi_byte_flag ) {
    recv_frame->recv_data_len++;
  }
  RcvPacket[0].packet_size = recv_frame->recv_data_len;


  RcvPacket[0].packet_data = &recv_frame->recv_data[0];


