qoAopx/relay_LoRa/esp32_e220900t22s_jp_lib_v2.cpp
  if ( IsNow_RecvPKT_CS_EN) {
    RcvPacket[0].packet_rssi = recv_frame->rssi = recv_frame->recv_data[len - 2] - 256;

  }

  return 0;
}

#else


  //--- for treating Single-Packet or Multi-Packets

  int arrayNo = 0;
  int dataTop = 0;

  RcvPacket[0].packet_address = 0xffff;
  RcvPacket[0].recv_multi_pkt_f = 0;
  RcvPacket[0].packet_error = 0;
  RcvPacket[0].packet_rssi = -200;

  int recvdata_end_ptr = len - 1;

  if ( IsNow_RecvPKT_SIZE_EN ) {                      // REG9 setting Received Data Length

    RcvPacket[arrayNo].packet_data = &recv_frame->recv_data[1];
    RcvPacket[arrayNo].packet_size = len - 1;

    if ( recv_frame->recv_data[0] == recvdata_end_ptr  ) {

      // Single-Packet

      int rtcode = CheckAndGetPacket(recv_frame, recvdata_end_ptr, checksum, previous_checksum, arrayNo, dataTop);
      recv_frame->rssi = RcvPacket[0].packet_rssi;

      if (rtcode == -1) return rtcode;

    } else {

      // Multi-Packets

      int Next_dataTop = 0;
      int Whole_Received_len = len - 1;

      Print("\n\n MultiPacket!!! %d", len);
      if ( IsNow_RecvPKT_CS_EN)
        recv_frame->rssi = recv_frame->recv_data[len - 2] - 256;

      while (1) {
        len = recv_frame->recv_data[dataTop];                 // len is the size of 1-packet
        recvdata_end_ptr = dataTop + len;
        Next_dataTop += len + 1;                              // +1 is The Size data check するかしないか

        Print("\nlen = %d ", len);

        RcvPacket[arrayNo].packet_size = len;
        RcvPacket[arrayNo].recv_multi_pkt_f = 0;
        RcvPacket[arrayNo].packet_address = 0xffff;
        RcvPacket[arrayNo].recv_multi_pkt_f = 0;
        RcvPacket[arrayNo].packet_error = 0;
        RcvPacket[arrayNo].packet_rssi = -200;

        checksum = 0;

        // Checksum 計算
        for (int i = 0; i <= len  ; i++   ) {
          uint8_t dt = recv_frame->recv_data[dataTop + i];
          previous_checksum = checksum;
          checksum ^= dt;
        }
        RcvPacket[arrayNo].packet_data = &recv_frame->recv_data[dataTop + 1];

        int rtcode = CheckAndGetPacket(recv_frame, recvdata_end_ptr, checksum, previous_checksum, arrayNo, dataTop);
        if (arrayNo >= 16 ) break;

        dataTop = Next_dataTop;
        if ( Next_dataTop >= Whole_Received_len ) return rtcode;

        RcvPacket[arrayNo].recv_multi_pkt_f = 1;
        ++arrayNo;
      }
    }
  } else {
    RcvPacket[arrayNo].packet_data = &recv_frame->recv_data[0];
    RcvPacket[arrayNo].packet_size = len;
    RcvPacket[arrayNo].packet_rssi = recv_frame->rssi;

    Print("\n\n No Received Data Length!!!");
    int rtcode = CheckAndGetPacket(recv_frame, recvdata_end_ptr, checksum, previous_checksum, arrayNo, dataTop);
    if (rtcode == -1) return rtcode;

  }
  return 0;
}
//#endif

int CLoRa::CheckAndGetPacket(RECVstrc *recv_frame, int recvdata_end_ptr, uint8_t checksum, uint8_t previous_checksum, int arrayNo, int dataTop) {

  if ( IsNow_RecvPKT_CS_EN) {
    Print("\nRECEIVE CHECKSUM (%d)= %02x %02x %02x \n",
          arrayNo, checksum, recv_frame->recv_data[recvdata_end_ptr], previous_checksum);

    if (checksum != 0) {
      RcvPacket[arrayNo].packet_error = -1;
      return -1;
    }

    RcvPacket[arrayNo].packet_size -= 1;
    recvdata_end_ptr --;
  }

  if ( config.rssi_byte_flag ) {
    RcvPacket[arrayNo].packet_size -= 1 ;
    RcvPacket[arrayNo].packet_rssi = recv_frame->recv_data[recvdata_end_ptr] - 256;
  }
  //  if ( IsNow_RecvPKT_AD_EN ) {
  if ( (IsNow_RecvPKT_AD_EN) && (config.transmission_method_type == 1) ) {

    if ( IsNow_RecvPKT_SIZE_EN ) {
      RcvPacket[arrayNo].packet_address = recv_frame->recv_data[dataTop + 1] | (recv_frame->recv_data[dataTop + 2] << 8);
    } else {
      RcvPacket[arrayNo].packet_address = recv_frame->recv_data[dataTop] | (recv_frame->recv_data[dataTop + 1] << 8);
    }
    RcvPacket[arrayNo].packet_size -= 2;
    RcvPacket[arrayNo].packet_data += 2;
  } else {
    RcvPacket[arrayNo].packet_address = config.own_address;
  }
  return 0;
}

#endif


int CLoRa::Check_BufferedReceiveData_Exist() {
  Buffered_ReceiveData = 0;

  if ( !SerialLoRa.available() ) return 1;
  if ( !ReceiveFrame(&data) ) {
    Print("\n No Received data in buffer");
    Buffered_ReceiveData = 1;
  }
  else  return 1;

  Print("\n\nReceived Data Exist.");
  for (int j = 0;; j++) {

    Print("\n RcvPacket[%d].packet_size = %d", j, RcvPacket[j].packet_size);
    Print("\n RcvPacket[%d].packet_address %02x%02x", j, RcvPacket[j].packet_address >> 8 , RcvPacket[j].packet_address & 0xff);
    Print("\n RcvPacket[%d].packet_data = ", j);
    for (int i = 0; i < RcvPacket[j].packet_size; i++) {
      Print(" %02x", RcvPacket[j].packet_data[i]);
      if ( i > 32 ) break;
    }
    Print("\n RcvPacket[%d].recv_multi_pkt_f = %d", j, RcvPacket[j].recv_multi_pkt_f);
    Print("\n RcvPacket[%d].packet_rssi = %d", j, RcvPacket[j].packet_rssi);

    if (RcvPacket[j].recv_multi_pkt_f == 0) break;
  }
  return 0;
}


// --- the end of ReceiveFlame // ver.2.0, ver2.8
#endif


#if ( (FIRMWARE_VERSION == 0x20) || (FIRMWARE_VERSION == 0x28))

int CLoRa::Read_RegisterLIB( uint8_t address, uint8_t bytes) {

  char checksum = 0;

  Check_BufferedReceiveData_Exist();

  REGData.REGUniStr.error = 0;

  SwitchToConfigurationMode();

  uint8_t ch = 0xc1;
  SerialLoRa.write(ch);
  checksum ^= ch;
  SerialLoRa.write(address);
  checksum ^= address;
  SerialLoRa.write(bytes);
  checksum ^= bytes;
  Print("\n++++ Read Register %02x %02x %02x ", ch, address, bytes);

  if ( IsNow_SendPKT_CS_EN ) {
    SerialLoRa.write(checksum);
    Print("%02x ", checksum);
  }

  SerialLoRa.flush();
  delay(100);

  Print("\n");

  uint16_t len = 0;
  while (SerialLoRa.available()) {
    uint8_t ch = SerialLoRa.read();
    Print("0x%02x ", ch);
    REGData.data[len++]  = ch;
  }
  Print("\n");
  if (len == 0) {
    Print("\n... No Response ...\n");
    REGData.REGUniStr.error = -1;

    return 1;
  }
  else {
    for (int i = 0; i < bytes + 3 ; i++) Print("%02x ", REGData.data[i] );
  }

  SwitchToNormalMode();

