qoAopx/relay_LoRa/esp32_e220900t22s_jp_lib_v2.cpp
  return 0;
}

int CLoRa::Read_RegisterLIB_s( uint8_t address, uint8_t bytes) {

  char checksum = 0;
  int recvflag = 0;
  int retcode = 0;

  Check_BufferedReceiveData_Exist();


  REGData.REGUniStr.error = 0;


  uint8_t ch = 0xc1;
  SerialLoRa.write(ch);
  checksum ^= ch;
  SerialLoRa.write(address);
  checksum ^= address;
  SerialLoRa.write(bytes);
  checksum ^= bytes;
  Print("\n++++ Read Register %02x %02x %02x ", ch, address, bytes);

  if ( IsNow_SendPKT_CS_EN ) {
    SerialLoRa.write(checksum);
    Print("%02x ", checksum);
  }

  SerialLoRa.flush();
  delay(200);

  Print("\n");

  uint16_t len = 0;
  while (SerialLoRa.available()) {
    uint8_t ch = SerialLoRa.read();
    Print("0x%02x ", ch);
    REGData.data[len++]  = ch;
  }
  Print("\n");
  if (len == 0) {
    Print("... No Response ...\n");
    REGData.REGUniStr.error = 1;
    retcode = 1;
  }
  else {
    for (int i = 0; i < bytes + 3 ; i++) Print("%02x ", REGData.data[i] );
  }

  return retcode;
}


int CLoRa::Write_RegisterLIB(const char* str, int str_length, uint8_t SetData) {

  char checksum = 0;

  Check_BufferedReceiveData_Exist();

  SwitchToConfigurationMode();
  PrintLn('\n');

  SerialLoRa.write(str, str_length);


  for (int i = 0; i < str_length ; i++) {
    char ch = str[i];
    checksum ^= ch;
    Print("%02x ", ch);
  }
  SerialLoRa.write(SetData);
  Print("%02x ", SetData);

  checksum ^= SetData;

  if ( IsNow_SendPKT_CS_EN ) {
    SerialLoRa.write(checksum);
    Print("%02x ", checksum);

  }
  SerialLoRa.flush();
  delay(100);

  Print("\n");

  return Skip_Receive_LoRa_Response();

}

int CLoRa::Skip_Receive_LoRa_Response() {
  int retcode = 0;

  uint16_t len = 0;
  while (SerialLoRa.available()) {
    char ch = SerialLoRa.read();
    Print("%02x ", ch);
    len++;
  }

  if (len == 0) {
    Print("... No Response ...\n");
    retcode = 1;
  }

  SwitchToNormalMode();

  return retcode;
}


//---
const char CNF_Write_09[3] = {'\xc0', '\x09', '\x01'};
const char CNF_Write_0A[3] = {'\xc0', '\x0A', '\x01'};


int CLoRa::REG09_ByteWrite() {
  int retcode = Write_RegisterLIB(CNF_Write_09, 3, REG09_Byte);
  PrintLn('\n');
  return retcode;
}

int CLoRa::REG09_ByteWrite(uint8_t setdata) {
  int retcode = Write_RegisterLIB(CNF_Write_09, 3, setdata);
  PrintLn('\n');
  return retcode;
}

int CLoRa::REG0A_ByteWrite() {
  int retcode = Write_RegisterLIB(CNF_Write_0A, 3, REG0A_Byte);
  PrintLn('\n');
  return retcode;
}

//---

int CLoRa::REG09_Set_AUX_HoldTime(uint8_t bt) {  /**  write AUX Hold Low Time */
  REG09_Byte = (REG09_Byte & 0b11111100) | bt;
  int retcode = REG09_ByteWrite();
  PrintLn('\n');
  return retcode;
}

int CLoRa::REG0A_Set_CarrierSenseTime(uint8_t ms) {   /** write AUX Hold Low Time */
  REG0A_Byte = ms;
  int retcode = REG0A_ByteWrite();
  PrintLn('\n');
  return retcode;
}
int CLoRa::Lowvoltage_operation_Enable() {
  REG09_Byte &= 0b01111111;
  int retcode = REG09_ByteWrite();
  return retcode;
}

int CLoRa::Lowvoltage_operation_Disable() {
  REG09_Byte |= 0b10000000;
  int retcode = REG09_ByteWrite();
  return retcode;
}


int CLoRa::StrictModeStart() {
  REG09_Byte |= StrictMode_EN;
  int retcode = REG09_ByteWrite();
  return retcode;

}

int CLoRa::StrictModeEnd() {
  REG09_Byte &= (StrictMode_EN ^ 0b11111111);
  int retcode = REG09_ByteWrite();
  return retcode;
}


int CLoRa::ReceivePKTaddCS() {
  if ( !IsNow_StrictMode ) return -1;

  REG09_Byte |= RecvPKT_CS_EN;
  int retcode = REG09_ByteWrite();
  return retcode;
}

int CLoRa::ReceivePKTdelCS() {
  if ( !IsNow_StrictMode ) return -1;

  REG09_Byte &= RecvPKT_CS_EN ^ 0b11111111;
  int retcode = REG09_ByteWrite();
  return retcode;
}

int CLoRa::SendPKTaddCS() {
  if ( !IsNow_StrictMode ) return -1;

  uint8_t setdata;
  setdata = REG09_Byte | SendPKT_CS_EN;
  int retcode = REG09_ByteWrite(setdata);
  REG09_Byte = setdata;
  return retcode;
}

int CLoRa::SendPKTdelCS() {
  if ( !IsNow_StrictMode ) return -1;

  uint8_t setdata;
  setdata = REG09_Byte & (SendPKT_CS_EN ^ 0b11111111);
  int retcode = REG09_ByteWrite(setdata);
  REG09_Byte = setdata;
  return retcode;
}

int CLoRa::ReceivePKTaddADRS() {
  if ( !IsNow_StrictMode ) return -1;

  REG09_Byte |= RecvPKT_AD_EN;
  int retcode = REG09_ByteWrite();
  return retcode;
}

int CLoRa::ReceivePKTdelADRS() {
  if ( !IsNow_StrictMode ) return -1;

  REG09_Byte &= RecvPKT_AD_EN ^ 0b11111111;
  int retcode = REG09_ByteWrite();
  return retcode;
}

int CLoRa::ReceivePKTaddSIZE() {
  if ( !IsNow_StrictMode ) return -1;

  REG09_Byte |= RecvPKT_SIZE_EN;
  int retcode = REG09_ByteWrite();
  return retcode;
}


int CLoRa::ReceivePKTdelSIZE() {
  if ( !IsNow_StrictMode ) return -1;

  REG09_Byte &= RecvPKT_SIZE_EN ^ 0b11111111;
  int retcode = REG09_ByteWrite();
  return retcode;
}



uint8_t CLoRa::write_id_num(char RegNum, uint8_t IDdata) {

  uint8_t retcode = 0;

  Check_BufferedReceiveData_Exist();

  SwitchToConfigurationMode();

  char checksum = 0;

  char WriteCommandChar = 0xc0;
  Print("\nWrite ID num Register =  ");

  SerialLoRa.write(WriteCommandChar);
  Print("%02x ", WriteCommandChar);

  SerialLoRa.write(RegNum);
  Print("%02x ", RegNum);
  SerialLoRa.write('\01');
  Print("%02x ", '\01');
  SerialLoRa.write(IDdata);
  Print("%02x ", IDdata);

  checksum ^= WriteCommandChar;
  checksum ^= RegNum;
  checksum ^= 0x01;
  checksum ^= IDdata;

  if ( IsNow_SendPKT_CS_EN ) {
    SerialLoRa.write(checksum);
    Print("%02x ", checksum);
  }

  SerialLoRa.flush();
  delay(100);

  Print("\n");

  return Skip_Receive_LoRa_Response();

}

uint8_t CLoRa::read_id_num(char RegNum) {
  uint8_t retcode = 0;

  Check_BufferedReceiveData_Exist();

  SwitchToConfigurationMode();

  char checksum = 0;

  Print("\nRead ID num Register =  ");

  char WriteCommandChar = 0xc1;
  SerialLoRa.write(WriteCommandChar);
  Print("%02x ", WriteCommandChar);
  SerialLoRa.write(RegNum);
  Print("%02x ", RegNum);
  SerialLoRa.write('\x01');
  Print("%02x ", '\x01');

  checksum ^= WriteCommandChar;
  checksum ^= RegNum;
  checksum ^= 0x01;

  if ( IsNow_SendPKT_CS_EN ) {
    SerialLoRa.write(checksum);
    Print("%02x ", checksum);
  }


  SerialLoRa.flush();
  delay(100);

  Print("\n");

  uint16_t len = 0;
  while (SerialLoRa.available()) {
    char ch = SerialLoRa.read();
    Print("0x%02x ", ch);
    REGData.data[len++]  = ch;
  }
  if (len == 0) {
    Print("... No Response ...\n");
    uint8_t retcode = 1;
  }
  SwitchToNormalMode();
  if ( IsNow_RecvPKT_SIZE_EN ) {
    for ( int i = 0; i < len ; i++) REGData.data[i] = REGData.data[i + 1];
  }
  return 0;
}




#endif
